% 例 5.4：台車型並列二重倒立振子の可制御性行列
% ## Symbolic Math Toolbox が必要

clear
format compact

syms g real
syms ac bc real
syms alpha1 alpha2 beta1 beta2

% --------------------------------------------------------
E = [ 1 0 0 0 0      0
      0 1 0 0 0      0
      0 0 1 0 0      0 
      0 0 0 1 0      0
      0 0 0 1 alpha1 0
      0 0 0 1 0      alpha2 ];

F = [ 0 0 0  1   0      0
      0 0 0  0   1      0
      0 0 0  0   0      1
      0 0 0 -ac  0      0 
      0 g 0  0  -beta1  0
      0 0 g  0   0     -beta2 ];
     
G = [ 0
      0
      0
      bc
      0
      0 ];

A = inv(E)*F;
B = inv(E)*G;

% --------------------------------------------------------
Mc = [ B A*B A^2*B A^3*B A^4*B A^5*B ];

disp(' ----- 可制御性行列 Mc ----- ')
det_Mc = simplify(det(Mc))

disp(' ----- 同じ振子の場合の可制御性行列 Mc ----- ')
det_Mc_same = subs(det_Mc,{alpha2,beta2},{alpha1,beta1})


% =======================================================
% =======================================================
ac  = 6.25e+000;    % 台車駆動系のパラメータ
bc  = 4.36e+000;    % 台車駆動系のパラメータ

mp1  = 1.07e-001;    % 振子1の質量
lp1  = 2.30e-001;    % 振子1の軸から重心までの長さ
Lp1  = 3.80e-001;    % 振子1の全長
Jp1  = 1.59e-003;    % 振子1の重心まわりの慣性モーメント
mup1 = 2.35e-004;    % 振子1の粘性摩擦係数

mp2  = 1.2*mp1;    % 振子2の質量
lp2  = 1.2*lp1;    % 振子2の軸から重心までの長さ
Lp2  = 1.2*Lp1;    % 振子2の全長
Jp2  = 1.2^3*Jp1;  % 振子2の重心まわりの慣性モーメント
mup2 = mup1;       % 振子2の粘性摩擦係数

g    = 9.81e+000;    % 重力加速度

% --------------------------------------------------------
alpha1 = (Jp1 + mp1*lp1^2)/(mp1*lp1);
beta1  = mup1/(mp1*lp1);
alpha2 = (Jp2 + mp2*lp2^2)/(mp2*lp2);
beta2  = mup2/(mp2*lp2);

% --------------------------------------------------------
E = [ 1 0 0 0 0      0
      0 1 0 0 0      0
      0 0 1 0 0      0 
      0 0 0 1 0      0
      0 0 0 1 alpha1 0
      0 0 0 1 0      alpha2 ];

F = [ 0 0 0  1   0      0
      0 0 0  0   1      0
      0 0 0  0   0      1
      0 0 0 -ac  0      0 
      0 g 0  0  -beta1  0
      0 0 g  0   0     -beta2 ];
     
G = [ 0
      0
      0
      bc
      0
      0 ];

A = inv(E)*F;
B = inv(E)*G;

% --------------------------------------------------------
Mcn = ctrb(A,B);

disp(' ----- 振子 2 が振子 1 の 1.2 倍のときの可制御性行列 Mc ----- ')
det_Mcn = det(Mcn)








